/*
8-1

<예외>
문법적인 오류가 없어 프로그램이 실행은 되지만 특수한 상황을 만나면 프로그램이 중단되는 현상.
특수한 상황이 발생하면 프로그램이 중단되는 현상으로 프로그램 코드에 의해서 해결 할 수 있는 오류.

오류 : 에러와 예외 포함
에러 : 프로그램 코드에 의해서 해결 할 수 없는 심각한 오류로 대처할 수 있는 에러.

<예외처리>
프로그램 실행 시 발생할 수 있는 예기치 못한 예외의 발생에 대비한 코드를 작성하는 것.
프로그램이 실행되는 도중에 발생할 수 있는 예상치 못한 상황에 대비하는 메커니즘.
예외를 방치하거나 에러로 인한 프로그램이 종료되지 않고 계속 작업을 처리하도록 해주거나 예외 내용을 확인하기 위한 작업.

<예외처리의 목적>
예외의 발생으로 인한 실행 중인 프로그램의 갑작스런 비정상적인 동작을 막고,
에러를 잡아 복구를 시도하거나 아니면 회피 하는식으로 처리를해서,
프로그램이 정상적인 실행상태를 유지할 수 있도록 하는 것이다.

1.프로그램의 안정성 향상
2.정보제공과 디버깅.
3.프로그램의 유연성 향상
4.사용자 경험 향상
*/
